app/controllers/records_controller.rb

INSERT INTO "records" ("latitude", "device_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["latitude", 100.99], ["device_id", 12], ["created_at", 2016-10-29 10:19:50 UTC], ["updated_at", 2016-10-29 10:19:50 UTC]]
---
  def create
    @record = Record.new(record_params)
    @record.save

SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @record = Record.find(params[:id])